//аргументом ця функція приймає загальну кількість елементів і повертати необхідну кількість сторінок (потрібно округлити отримавше значення на більшу сторону)
export const getPageCount = (totalCount,limit) => {
    return Math.ceil(totalCount/limit) //функцією Math.ceil ми можем округлити отримавше значення в більшу сторону(якщо елементів буде 105 то замість ділення на 10 елементів ми будем ділити на 11 і на останній сторінці ми відобразим тих 5 елементів які залишились)
}

//створюєм функцію яка приймає загальну кількість сторінок і на основі цієї кількості заповнює масив 
export const getPagesArray = (totalPages) => {
    let result = [] //створюєм масив result який будем повертати 
    for (let i = 0 ;i<totalPages ;i++){//формуєм масив у якому значення прописуєм від 1 до 10
        result.push(i+1)//цей масив заповнюєм числами від 1 до кількості сторінок
    }
    return result//тут масив result повертаєм
}