import { useState } from 'react'

//Створюєм хук який обробляє функціонал загрузки і ошибки запросу на отримання даних (при цьому повертає нам масив який складається із 3 елементів)
export const useFetching = (callback) =>{ // тут прописуєм запрос передяким крутилку треба показати і після виконання якого крутилку треба убрати
    const[isLoading,setIsLoading] = useState(false)//створюєм стан який відповідає за загрузку (за замовчуванням ставим false)
    const[error, setError] = useState(' ')//створюєм стан (опрацювання ошибок) , якщо запрос пройшов із ошибкою то її треба опрацювати і показати інформацію(за замовчуванням ставим пусте місце,коли буде появлятись ошибка то в це місце вона буде прописуватись)
    const fetching = async () =>{
        //функція  try { }catch вловлює потенційно можливі ошибки 
        try {
            setIsLoading(true)//тут робим стан щоб показалась крутилка
            await callback()// тут визиваєм callback який прийняли аргументом
        }catch (e) {
            setError(e.message)// якщо пройшла ошибка то ми викликаєм функцію setError в яку розміщуєм сповіщення про ошибку
        } finally {
            setIsLoading(false)// в блоці finally незалежно від того чи пройшла ошибка робим стан false
        }
    }
    return[fetching,isLoading,error]// тут ми повертаєм функцію fetching(щоб в потрібному місці її визвати)
}